; domain
(define (domain agrodrone)
  (:requirements :strips :typing)
  (:types location pesticide)
  (:predicates
    (at ?l - location)
    (loaded ?p - pesticide)
    (sprayed ?l - location ?p - pesticide)
  )
  (:action load
    :parameters (?p - pesticide)
    :precondition (at base)
    :effect (loaded ?p)
  )
  (:action fly
    :parameters (?from ?to - location)
    :precondition (at ?from)
    :effect (and (at ?to) (not (at ?from)))
  )
  (:action spray
    :parameters (?l - location ?p - pesticide)
    :precondition (and (at ?l) (loaded ?p))
    :effect (sprayed ?l ?p)
  )
)

; problem
(define (problem agrodrone-prob)
  (:domain agrodrone)
  (:objects
    ;; locations
    base black_spot canker melanose greening healthy - location
    ;; pesticides (unique names!)
    black_spot_p canker_p melanose_p greening_p water - pesticide
  )
  (:init
    (at base)
  )
  (:goal
    (and
      (sprayed black_spot black_spot_p)
      (sprayed canker    canker_p)
      (sprayed melanose  melanose_p)
      (sprayed greening  greening_p)
      (sprayed healthy   water)
      (at base)
    )
  )
)

; plan
1. (load water)
   added: (loaded water)
   goals met: 1 of 6
2. (load greening_p)
   added: (loaded greening_p)
   goals met: 1 of 6
3. (load black_spot_p)
   added: (loaded black_spot_p)
   goals met: 1 of 6
4. (load canker_p)
   added: (loaded canker_p)
   goals met: 1 of 6
5. (load melanose_p)
   added: (loaded melanose_p)
   goals met: 1 of 6
6. (fly base melanose)
   deleted: (at base)
   added: (at melanose)
   goals met: 0 of 6
7. (spray melanose melanose_p)
   added: (sprayed melanose melanose_p)
   goals met: 1 of 6
8. (fly melanose black_spot)
   deleted: (at melanose)
   added: (at black_spot)
   goals met: 1 of 6
9. (spray black_spot black_spot_p)
   added: (sprayed black_spot black_spot_p)
   goals met: 2 of 6
10. (fly black_spot canker)
   deleted: (at black_spot)
   added: (at canker)
   goals met: 2 of 6
11. (spray canker canker_p)
   added: (sprayed canker canker_p)
   goals met: 3 of 6
12. (fly canker healthy)
   deleted: (at canker)
   added: (at healthy)
   goals met: 3 of 6
13. (spray healthy water)
   added: (sprayed healthy water)
   goals met: 4 of 6
14. (fly healthy greening)
   deleted: (at healthy)
   added: (at greening)
   goals met: 4 of 6
15. (spray greening greening_p)
   added: (sprayed greening greening_p)
   goals met: 5 of 6
16. (fly greening base)
   deleted: (at greening)
   added: (at base)
   goals met: 6 of 6
